Revit 2018 API
ApplicationEntryPoint Properties
The ApplicationEntryPoint type exposes the following members.
Properties
Name | Description
ActiveAddInId
Retrieves the Id of the currently running external application.
 (Inherited from Application.)
AddinFolder
 The full path to the Revit Macros module.
AllowNavigationDuringRedraw
 Checks whether or not the navigation during redraw is enabled, and enable or disable it.
 (Inherited from Application.)
AllUsersAddinsLocation
 The folder location for .addin files for all users.
 (Inherited from Application.)
AngleTolerance
 Angle tolerance.
 (Inherited from Application.)
Assets
Returns a set of all the Assets within Revit of special type.
 (Inherited from Application.)
BackgroundColor
 The background color to use for model views in this session.
 (Inherited from Application.)
Cities
Returns a set of all the known city locations within Revit.
 (Inherited from Application.)
Create
Provides an object that can be used to create new instances of Autodesk Revit API objects.
 (Inherited from Application.)
CurrentRevitServerAccelerator
 Current Revit Server accelerator.
 (Inherited from Application.)
CurrentUserAddinsLocation
 The folder location for .addin files for the current user.
 (Inherited from Application.)
DefaultIFCProjectTemplate
 Full path to the default template file for new IFC project documents. It may be empty, in which case the DefaultProjectTemplate should be used.
 (Inherited from Application.)
DefaultProjectTemplate
 Full path to the default template file for new project documents.
 (Inherited from Application.)
DefaultViewDiscipline
 The view discipline that will be applied to new views by default.
 (Inherited from Application.)
Documents
 Returns a set of documents within Revit.
 (Inherited from Application.)
ExportIFCCategoryTable
 Full path to the file that defines Revit category to IFC entity mappings for IFC export.
 (Inherited from Application.)
FamilyTemplatePath
 Default path for family template files.
 (Inherited from Application.)
ImportIFCCategoryTable
 Full path to the file that defines IFC entity to Revit category mappings for IFC import.
 (Inherited from Application.)
IsArchitectureEnabled
 Checks whether or not the architecture discipline is enabled, and enable or disable it.
 (Inherited from Application.)
IsElectricalAnalysisEnabled
 Checks whether or not electrical analysis is enabled, and enable or disable it.
 (Inherited from Application.)
IsElectricalEnabled
 Checks whether or not the electrical discipline is enabled, and enable or disable it.
 (Inherited from Application.)
IsEnergyAnalysisEnabled
 Checks whether or not energy analysis is enabled, and enable or disable it.
 (Inherited from Application.)
IsMassingEnabled
 Checks whether or not the massing and site tools are enabled, and enable or disable them.
 (Inherited from Application.)
IsMechanicalAnalysisEnabled
 Checks whether or not mechanical analysis is enabled, and enable or disable it.
 (Inherited from Application.)
IsMechanicalEnabled
 Checks whether or not the mechanical discipline is enabled, and enable or disable it.
 (Inherited from Application.)
IsPipingAnalysisEnabled
 Checks whether or not piping analysis is enabled, and enable or disable it.
 (Inherited from Application.)
IsPipingEnabled
 Checks whether or not the piping discipline is enabled, and enable or disable it.
 (Inherited from Application.)
IsStructuralAnalysisEnabled
 Checks whether or not the structural analysis is enabled, and enable or disable it.
 (Inherited from Application.)
IsStructureEnabled
 Checks whether or not the structure discipline is enabled, and enable or disable it.
 (Inherited from Application.)
IsSubscriptionUpdate |  Obsolete.
 True if this version of Revit is a subscription update.
 (Inherited from Application.)
IsSystemsEnabled
 Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
 (Inherited from Application.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Application.)
Language
The language used in the current session of Revit.
 (Inherited from Application.)
LoginUserId
 The user id of the user currently logged in. The user id will be empty if the user is not logged in.
 (Inherited from Application.)
PointCloudsRootPath
 Root path for point cloud files.
 (Inherited from Application.)
Product
 The product type for the current session of Revit.
 (Inherited from Application.)
RecordingJournalFilename
 Retrieve the name of the journal file the Revit is currently recording to.
 (Inherited from Application.)
SharedParametersFilename
Contains the fully qualified path to a shared parameters file.
 (Inherited from Application.)
ShortCurveTolerance
 The enforced minimum length for any curve created by Revit.
 (Inherited from Application.)
ShowGraphicalWarningCableTrayConduitDisconnects
 Whether or not to show the graphical warnings for CTC disconnects.
 (Inherited from Application.)
ShowGraphicalWarningDuctDisconnects
 Whether or not to show the graphical warnings for duct disconnects.
 (Inherited from Application.)
ShowGraphicalWarningElectricalDisconnects
 Whether or not to show the graphical warnings for Electrical disconnects.
 (Inherited from Application.)
ShowGraphicalWarningHangerDisconnects
 Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
 (Inherited from Application.)
ShowGraphicalWarningPipeDisconnects
 Whether or not to show the graphical warnings for Pipe disconnects.
 (Inherited from Application.)
SubVersionNumber
 The minor version number of Revit
 (Inherited from Application.)
Username
 Gets the user name for the current Revit session.
 (Inherited from Application.)
VersionBuild
 Returns the internal build number of the Autodesk Revit application.
 (Inherited from Application.)
VersionName
 Returns the name of the Revit application.
 (Inherited from Application.)
VersionNumber
 Return the primary version of the Revit application.
 (Inherited from Application.)
VertexTolerance
 Vertex tolerance.
 (Inherited from Application.)
See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace